app/controllers/api/notes_controller.rb

  def create
    @note = Note.new(note_params)
    @note.author_id = current_user.id
    if @note.save
---
INSERT INTO "notes" ("title", "body", "author_id", "notebook_id", "created_at", "updated_at", "body_delta") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"