app/controllers/api/notes_controller.rb

SELECT  "notes".* FROM "notes" WHERE "notes"."id" = $1 LIMIT $2  [["id", 29], ["LIMIT", 1]]
DELETE FROM "notes" WHERE "notes"."id" = $1  [["id", 29]]
---
  def destroy
    @note = Note.find(params[:id])
    if @note.author_id == current_user.id
      @note.destroy!

SELECT  "notes".* FROM "notes" WHERE "notes"."id" = $1 LIMIT $2  [["id", 30], ["LIMIT", 1]]
---
  def show
    @note = Note.find(params[:id])

SELECT  "notes".* FROM "notes" WHERE "notes"."id" = $1 LIMIT $2  [["id", 30], ["LIMIT", 1]]
UPDATE "notes" SET "title" = $1, "body" = $2, "body_delta" = $3, "updated_at" = $4 WHERE "notes"."id" = $5  [["title", "hi"], ["body", "\n"], ["body_delta", "{\"ops\":[{\"insert\":\"\\n\"}]}"], ["updated_at", 2017-06-10 23:36:43 UTC], ["id", 30]]
---
  def update
    @note = Note.find(params[:id])

    if @note.update(note_params) && @note.author_id == current_user.id