app/controllers/api/notebooks_controller.rb

  def create
    @notebook = Notebook.new(notebook_params)
    @notebook.author_id = current_user.id
    if @notebook.save
---
INSERT INTO "notebooks" ("author_id", "title", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["author_id", 1], ["title", "sdfsfdf"], ["created_at", 2017-06-16 00:38:43 UTC], ["updated_at", 2017-06-16 00:38:43 UTC]]

  def destroy
    @notebook = Notebook.find(params[:id])
    unless lastNotebook? || @notebook.author_id != current_user.id
      @notebook.destroy!
---
SELECT  "notebooks".* FROM "notebooks" WHERE "notebooks"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "notebooks" WHERE "notebooks"."id" = $1  [["id", 3]]
DELETE FROM "notes" WHERE "notes"."id" = $1  [["id", 9]]